Hello @ewbankkit,

```
Terraform will perform the following actions:
  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ created_at                = "2020-12-15 11:39:01.609 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://endpoint" -> (known after apply)
      ~ id                        = "eks-sandbox-us-east-2" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "abc1234"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "eks-sandbox-us-east-2"
      ~ platform_version          = "eks.3" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "Application_Role"    = "Kubernetes"
            "Application_Version" = "1.19"
            "Environment"         = "sandbox"
            "Name"                = "eks-sandbox-us-east-2"
            "Owner"               = "DevOps"
            "Terraform"           = "v0.14"
            "Terraform-Workspace" = "eks-sandbox-us-east-2"
        }
        # (2 unchanged attributes hidden)
      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }
      ~ vpc_config {
          ~ cluster_security_group_id = "sg-abcabc" -> (known after apply)
          ~ vpc_id                    = "vpc-abcabc" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }
  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                            "ec2:DescribeAccountAttributes",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
      ~ tags        = {
          + "Application_Role"    = "Kubernetes"
          + "Application_Version" = "1.19"
          + "Environment"         = "sandbox"
          + "Name"                = "eks-sandbox-us-east-2"
          + "Owner"               = "DevOps"
          + "Terraform"           = "v0.14"
          + "Terraform-Workspace" = "eks-sandbox-us-east-2"
        }
      ~ tags_all    = {
          + "Application_Role"    = "Kubernetes"
          + "Application_Version" = "1.19"
          + "Environment"         = "sandbox"
          + "Name"                = "eks-sandbox-us-east-2"
          + "Owner"               = "DevOps"
          + "Terraform"           = "v0.14"
          + "Terraform-Workspace" = "eks-sandbox-us-east-2"
        }
        # (5 unchanged attributes hidden)
    }
  # module.eks.aws_iam_role.cluster[0] must be replaced
+/- resource "aws_iam_role" "cluster" {
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                        Sid       = "EKSClusterAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-12-15T11:38:50Z" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      - name_prefix           = "eks-sandbox-us-east-2" -> null # forces replacement
        tags                  = {
            "Application_Role"    = "Kubernetes"
            "Application_Version" = "1.19"
            "Environment"         = "sandbox"
            "Name"                = "eks-sandbox-us-east-2"
            "Owner"               = "DevOps"
            "Terraform"           = "v0.14"
            "Terraform-Workspace" = "eks-sandbox-us-east-2"
        }
      ~ unique_id             = "uniqueid" -> (known after apply)
        # (4 unchanged attributes hidden)
      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }
    ```
    
    This is a snippet from our terraform plan.
    
    Thanks,
    -Ionut